{"meta":{"title":"kzwkzw's homepage","subtitle":"","description":"","author":"kzwkzw","url":"https://kzwkzw123.github.io","root":"/"},"pages":[{"title":"about","date":"2025-06-21T14:28:02.000Z","updated":"2025-06-21T14:28:02.323Z","comments":true,"path":"about/index.html","permalink":"https://kzwkzw123.github.io/about/index.html","excerpt":"","text":""},{"title":"link","date":"2025-06-21T14:27:51.000Z","updated":"2025-06-21T14:29:30.217Z","comments":true,"path":"link/index.html","permalink":"https://kzwkzw123.github.io/link/index.html","excerpt":"","text":""},{"title":"tags","date":"2025-06-21T14:26:48.000Z","updated":"2025-06-21T14:28:42.872Z","comments":true,"path":"tags/index.html","permalink":"https://kzwkzw123.github.io/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2025-06-21T14:27:05.000Z","updated":"2025-06-21T14:29:13.007Z","comments":true,"path":"categories/index.html","permalink":"https://kzwkzw123.github.io/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"2025-春-大一下","slug":"2025-春-大一下","date":"2025-06-23T11:19:43.000Z","updated":"2025-06-24T10:13:12.072Z","comments":true,"path":"2025/06/23/2025-春-大一下/","link":"","permalink":"https://kzwkzw123.github.io/2025/06/23/2025-%E6%98%A5-%E5%A4%A7%E4%B8%80%E4%B8%8B/","excerpt":"","text":"高等数学A（二）授课教师：童嘉骏 这学期有幸再次选上了童老师的课。总的来说，童老师这学期依旧延续上学期的风格，上课很有条理，板书写得很清楚，在很多地方都有拓展，每周依旧会更新补充习题集，补充一些题目和数分的知识。这学期课后留下来问问题的同学比上学期多了，老师也会热心地解答，讨论的氛围很好。上童老师的课会有很多收获，可以放心选！ 另外，这学期期末考试的难度众所周知，其中有不少数学分析（二）期末考试的原题，难度很大，光靠课本上的知识以及xyt讲义上的内容应该是无法完全应对的。关于这个树洞上的评论很多，就不再多说了。 可能看一些统分数据，童老师班的平均分和中位数都要比别的班低很多，但个人认为这并不意味着教学水平的问题。可能平时上课以及习题课很少讲应试方面的内容，也可能来这个班的佬比较少，所以平均分都比较低。 个人得分：【85，90） 推荐指数：5/5电磁学授课教师：何琼毅 何老师上课按照《大学物理通用教程——电磁学》的顺序讲，前半个学期讲电，后半个学期讲磁。由于这学期电磁学改成三学分了，所以难度有所下降，老师也会在课上明确指出哪些内容不考，对于没有基础的同学来说是相当友好的。老师上课以讲ppt为主，有时会介绍一些前沿的知识（不过不考），听感还是不错的。 关于考试，考试内容不超出平时的作业，ppt上的思考题的难度。这个学期期中考的很简单，往年题含量很高；期末为了限制优秀率出的比较难，值得一提的是，期末考试的难度主要在计算量大，题量很多，要在两个小时内写完比较困难，但每道题的思路大多在平时的作业中有体现，应该来说把作业题和思考题掌握后，应对考试没什么问题。复习的时候建议关注往年题，包括lq，shb，mc老师的，都在期中期末卷中出现过。 个人得分：【90，95） 推荐指数：5/5热学授课教师：穆良柱 穆法师这学期黑化了（指给分方面）！但似乎又没完全黑化（受伤的只有2学分热学），班上最终得分很多七十几的，九十以上的不多，给分没有以前那么好了。如果比较在意分数的话以后可能要慎重考虑了！ 从上课内容上看，穆法师还是延续了ETA的教学思路，可能对大部分同学来说一开始比较难适应，不过习惯之后其实听感不错。由于这学期热学改为2学分，讲的东西比以往难度更低，比较难的部分也有在课上明确不考，还有就是课上做的实验少了很多（可能是因为课时少了）。法师在课上经常开玩笑，也会讲讲人生哲学。课后作业很少，难度也不大。总体来说，穆老师的课还是相当有意思的，也能学到点东西（本人今年的cupt就是按eta的思路做的）。 关于考试，法师的卷子一般都会设几道很奇怪的简答题，不过大都是在课上讲过的。剩下的计算题难度和作业题相当，大都是课上讲的并且重点板书的知识。总的来说还是教什么考什么的。 个人得分：【90，95） 推荐指数：4/5数据结构与算法B授课教师：孙艳春 孙老师上课按照自己做的ppt讲，先讲几个线性结构，再讲树和图，中间穿插检索、排序等算法。ppt内容写得非常详尽易懂，考前只需要对着ppt复习便可应对期末的几乎所有考题。孙老师上课讲的非常清楚，也会照顾到基础比较薄弱的同学，尤其是在讲一些算法以及数据结构的实现时，孙老师会用具体的例子演示，并非常细致地说明每一步的操作，对没什么基础的同学非常友好。另外两位助教也非常的认真负责。总而言之，这是能让人学到很多东西的一门课。 这次的期末考试比较简单，可能出于优秀率限制，最终的给分和上机考试关联，以ac4和ac5作为分水岭，上机考试的难度比平时的作业以及模拟上机都要简单，并且更加侧重算法，对数据结构的考察比较少。平时会有不定期的小测，不过不计分，旨在考勤，交了就满分（当然不能过于敷衍）。 总而言之，孙老师好人，可以放心选！ 个人得分：【95，100） 推荐指数：5/5大气科学导论授课教师：赵传峰 这门课的定位主要是大气科学方向的基础课，以及给其他方向的同学介绍大气科学相关的知识，本学期也有很多空飞班的同学选课。 课上主要介绍大气科学相关方向的最为基础的知识，以理解记忆为主，对数理基础的要求很低，可以放心选。另外，这门课的授课内容以及考核方式很大程度上受到授课教师的影响，赵老师是做云物理的，所以会侧重讲一些云方面的知识，而对古气候，海洋，大气动力学等方面则讲得相对较少。 考试的内容基本都在ppt上，期中是闭卷考，期末允许带一张cheating paper，老师给分很好，对大气感兴趣的同学可以放心选。 个人得分：【95，100） 推荐指数：5/5普通物理实验（2）授课教师：李智（等） 著名的“国家级精品课2.0”，这学期由于已经学习的力学和电磁学，很多实验的理论部分都可以很快理解了，总体感受比上个学期要好很多。 但值得注意的是，光学实验的难度比较大，尤其是有一个名叫“光信息处理”的实验，需要傅里叶光学的知识，建议没有基础的同学早点开始预习；另外这个实验的老师给分比较严，写实验报告前建议问清楚老师需要报告上包含哪些内容。 另外，这学期的给分依旧延续上学期的情况，看统分洞似乎得分主要取决于上课的时间段？ 个人得分：【90，95） 推荐指数：3/5中国近现代史纲要授课教师：贾凯 广为人知的需要避雷的老师，避雷的点主要在于给分极差以及经常点名，不过我们这学期是物院专班，最终应该进行了调分，给分相对来说挺不错的，但另一个班的给分可谓是相当的差了。 不过上课方面，贾老师会注重讲一些我们中学阶段没学过的东西（当然也可能是因为我是理科生学的比较少），尤其侧重介绍一些历史事件的复杂性（实际情况真的比中学课本讲的复杂的多），上课还是挺有意思的，能了解不少东西。 关于考勤，上课确实会有不定期点名，而且不光是点名，还会要求发表对上一节课内容的感想，不过我们班似乎达成一致了，问到感想的时候都是清一色的“没有”。课后会有一个留言板，用于对本节课的内容进行提问，提问后会有加分，不过我们班似乎很少有同学卷这个。 个人得分：【95，100） 推荐指数：3/5国际象棋授课教师：侯逸凡 一门不需要运动的体育课！侯老师是世界冠军，不过课程难度不大，也是针对零基础的（当然也有有基础的来刷分的，不过比例不大），可以放心选。 课程会从棋子的基本走法开始讲，然后会讲定式杀王，基本开局，基本战术等等，不过都是比较基础的内容。考核会分为理论考核和对弈，理论考又分为基础知识和棋题解答，很多都在ppt上，比较基础，棋题解答会有一两道有区分度的题目。老师给分很好，本人应该是只扣了体测分。 个人得分：【90，95） 推荐指数：5/5全球视野下的犹太文明授课教师：杨梦 众所周知，这是一门饱受争议的课，不过下学期改为百分制了，选的同学应该会少很多，这个测评就仅供参考了。 前半个学期会讲犹太文化以及纳粹屠犹，应该是能学到不少知识的；后半个学期会讲反犹主义，可能因为本人是理科生，有很多东西听不太懂，也不大清楚老师想表达什么。老师有很强的个人立场，如果立场和老师不同可能上课会比较难受。并且由于上学期f的惨案，很多同学（比如我）都时常陷入担心f的焦虑中，可能对承受能力比较差的同学来说并不是个好的选择。 另外老师会高强度刷树洞，并且把一些涉及反犹的洞挂到课堂上讲（经典之“犹太数学题”），另外老师似乎能从后台把同学盒出来（仅猜测），所以发言须谨慎？ 考核方式分为创意作业和随堂作业（即期末考试）两种，创意作业是完成一件与上课内容相关的作品，也可以写调查报告，可以利用ai，如果过了就不用参加考试。考试有选择题和简答题，开放ai，本人是创意作业通过了，所以不大清楚考什么。另外，这学期f的似乎比上学期少。 个人得分：P 推荐指数：1/5","categories":[{"name":"课程测评","slug":"课程测评","permalink":"https://kzwkzw123.github.io/categories/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"}],"tags":[{"name":"课程测评","slug":"课程测评","permalink":"https://kzwkzw123.github.io/tags/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"}]},{"title":"2024-秋-大一上","slug":"2024-秋-大一上","date":"2025-06-22T07:36:09.000Z","updated":"2025-06-22T14:45:31.366Z","comments":true,"path":"2025/06/22/2024-秋-大一上/","link":"","permalink":"https://kzwkzw123.github.io/2025/06/22/2024-%E7%A7%8B-%E5%A4%A7%E4%B8%80%E4%B8%8A/","excerpt":"","text":"高等数学A（一）授课教师：童嘉骏 童老师上课按照自己写的讲稿来讲，不book reader，并且全程板书，板书的内容清晰有层次，对于记笔记的同学来说很友好。对于一些重点或者是比较抽象的东西，老师会讲一些直观上的认知，并且讲一些例题帮助我们理解，有时会适当拓展一些分析的东西。总的来说，老师的课听感是非常不错的，可以放心选！ 童老师每周都会更新一次《补充习题集》，但不强制要求完成，里面主要包括一些老师认为比较有价值的题目，还有一些“私货”（指一些数分的内容），有些题目难度会比较大，不过老师会给一些提示。个人认为是非常值得做的。 另外关于这门课本身，如果想取得一个不错的成绩，课后还是得花很多时间的（当然大佬除外），个人建议课后把xyt讲义全刷一遍（尽管上面写的是“高数B用”），对拓宽思路很有帮助，期末甚至有考讲义上的原题。 个人得分：【90，95） 推荐指数：5/5线性代数B授课教师：李谷川 李老师上课主要按照邱维声《简明线性代数》讲，拓展的内容不多。上课会写板书，但个人感觉板书的内容相对来说比较的乱；每节课会花一部分时间对上节课的内容进行回顾，并且强调其中的重点。个人认为老师讲课还是很清楚的，对于一些比较抽象的内容会举一些最简单的例子辅助理解，而且经常会把教材中一些比较难理解的语言翻译成“人话”。李老师的课并不算热门（起码我们这个学期不算），如果选不上热门的老师可以作为不错的备选。 对于这门课本身，这个学期的期中和期末考试相较前几个学期难度明显下降了很多，但不知道以后会怎样。按照往年的经验，复习的时候除教材外，mym助教的讲义和邱砖都是重要复习资料，考试时有考邱砖上的原题。 个人得分：【90，95） 推荐指数：4/5力学授课教师：刘树新 刘老师上课按照自己编的教材的顺序来讲，上课的调理非常清晰，难度与其他老师相比应该算是最简单的了，对于一些比较难的东西会在课上明确说明不考，对于零基础的同学来说十分友善。在讲力学之外，刘老师还会讲一些历史，还有一些偏哲学的东西，课上时不时会讲一些笑话，总体来说课堂的内容很丰富，听感很不错！ 刘老师会设置一些加分的内容，主要是给他编的教材纠错，还有课上的加分思考题（不是ppt上所有思考题，老师会讲哪些是有加分的），思考题难度很大，很少有同学能拿到加分（我们这学期班里似乎只有一位同学拿到了），不过给教材纠错还是相对比较容易一些（但不知道以后错误会不会被找光了）。 我们这学期没有期中考试，以“给教材课后习题编写解答”的大作业形式进行。期末考试的往年题含量很高，但有两道比较难的大题来限制优秀率（其中一道似乎也是往年题）。另外，网上流传的刘老师的往年题大多比较古早，但事实证明已经足够了（尤其是填空题，重合度很高）。 个人得分：【90，95） 推荐指数：5/5计算概论B授课教师：陈泓婕 如果对计算机不感兴趣，仅仅是想把这门课水过去，并且拿一个不错的分数，陈老师的课或许是个不错的选择。可以选她的课，然后到b站上找个视频或者是找yhf老师的资料自学（需要自学，这很重要），老师给分还是挺不错的。 但如果对计算机很感兴趣，想要进一步学习的，建议找别的老师。 陈老师上课主要按照ppt讲，但个人认为上课讲的比较乱，而且ppt的内容也很乱，如果只是上课的话可能收获不大，并且会消磨对计算机的兴趣（个人观点）。老师上课不定期会有小测，所以需要去上课。平时上机的难度不大，任务量也不大，但这学期的机考难度远超于平时的难度，导致班里得分普遍低，不过如果找别的资料自学的话，还是能取得不错的分数的。 个人得分：【95，100） 推荐指数：2/5（想认真学）；4/5（想水）普通物理实验（1）授课教师：李智（等） 著名的“国家级精品课”，由于我们这届把实验课从大二移到了大一，导致像我这种没什么基础同学每周都要花大量的时间预习实验理论，即便如此，上课老师讲的内容还有很多因为知识储备的欠缺而很难懂。课后写实验报告时涉及理论分析的部分更是要花时间。 这门课广为诟病的原因主要是它的评分机制，不少同学投入了大量的时间却无法收获满意的成绩，而且给分的透明度很低，报告的等第和最终得分的相关性不明确，可能最终的得分主要取决于授课的老师（？）。即便如此，这门课还是需要花很多时间上去的，个人经验是预习的时候多看看课程网站上的视频，写报告的时候可以问问老师对报告的具体要求。 不过，个人认为去除诸如评分体系等等的因素，做实验本身还是相当有意思的，也能学到不少东西。 个人得分：【90，95） 推荐指数：3/5思想道德与法治授课教师：钟启东 今明老师上课基本完全不按教材的内容讲，会讲很多哲学的东西，课上也经常会讲一些笑话，听感很棒。或许比起教材上那些苦涩的内容，老师讲的东西要有意思的多。 另外，这也意味着考试和上课讲的没什么关系，备考的时候建议直接找一份涵盖课后思考题的复习资料背，考的内容大多都在课后思考题上（我们这学期是）。 关于得分，可能由于我们这个班是物院专班，相较于其他班的给分要好点。 个人得分：【95，100） 推荐指数：4/5地震概论授课教师：赵克常 教员伟大，无需多言！ 一门努力就会有回报的课，地震知识+幽默笑话+人生哲学丝滑切换，课堂体验极佳。考前建议把回放再过一边，重点关注教员反复强调的东西。 个人得分：100 推荐指数：5/5军事理论授课教师：户国栋（等） 这门课主要是请国防大学的老师来给我们上课，可以在课上学到很多军事相关的知识，个人感觉挺有意思的，也能拓展视野，了解时事。有签到，需要来上课。 关于考试，除了小论文外，剩下的题目全都在每节课给的思考题上，还有必考的征兵政策，期末直接收一份资料背就行了。 个人得分：【90，95） 推荐指数：3/5形势与政策授课教师：邱华宇（等） pf制，课上会讲一些时政相关的知识，也算是开拓视野吧，没有期末考，要交一篇和课程相关的论文。有签到，需要来上课。 推荐指数：3/5","categories":[{"name":"课程测评","slug":"课程测评","permalink":"https://kzwkzw123.github.io/categories/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"}],"tags":[{"name":"课程测评","slug":"课程测评","permalink":"https://kzwkzw123.github.io/tags/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"}]},{"title":"Hello World","slug":"hello-world","date":"2025-06-21T10:47:41.049Z","updated":"2025-06-22T07:40:10.103Z","comments":true,"path":"2025/06/21/hello-world/","link":"","permalink":"https://kzwkzw123.github.io/2025/06/21/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"课程测评","slug":"课程测评","permalink":"https://kzwkzw123.github.io/categories/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"}],"tags":[{"name":"课程测评","slug":"课程测评","permalink":"https://kzwkzw123.github.io/tags/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"}]}