{"meta":{"title":"kzwkzw's homepage","subtitle":"","description":"","author":"kzwkzw","url":"https://kzwkzw123.github.io","root":"/"},"pages":[{"title":"link","date":"2025-06-21T14:27:51.000Z","updated":"2025-06-21T14:29:30.217Z","comments":true,"path":"link/index.html","permalink":"https://kzwkzw123.github.io/link/index.html","excerpt":"","text":""},{"title":"about","date":"2025-06-21T14:28:02.000Z","updated":"2025-06-21T14:28:02.323Z","comments":true,"path":"about/index.html","permalink":"https://kzwkzw123.github.io/about/index.html","excerpt":"","text":""},{"title":"tags","date":"2025-06-21T14:26:48.000Z","updated":"2025-06-21T14:28:42.872Z","comments":true,"path":"tags/index.html","permalink":"https://kzwkzw123.github.io/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2025-06-21T14:27:05.000Z","updated":"2025-06-21T14:29:13.007Z","comments":true,"path":"categories/index.html","permalink":"https://kzwkzw123.github.io/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"2024-秋-大一上","slug":"2024-秋-大一上","date":"2025-06-22T07:36:09.000Z","updated":"2025-06-22T14:41:15.521Z","comments":true,"path":"2025/06/22/2024-秋-大一上/","link":"","permalink":"https://kzwkzw123.github.io/2025/06/22/2024-%E7%A7%8B-%E5%A4%A7%E4%B8%80%E4%B8%8A/","excerpt":"","text":"[TOC] 高等数学A（一）授课教师：童嘉骏 童老师上课按照自己写的讲稿来讲，不book reader，并且全程板书，板书的内容清晰有层次，对于记笔记的同学来说很友好。对于一些重点或者是比较抽象的东西，老师会讲一些直观上的认知，并且讲一些例题帮助我们理解，有时会适当拓展一些分析的东西。总的来说，老师的课听感是非常不错的，可以放心选！ 童老师每周都会更新一次《补充习题集》，但不强制要求完成，里面主要包括一些老师认为比较有价值的题目，还有一些“私货”（指一些数分的内容），有些题目难度会比较大，不过老师会给一些提示。个人认为是非常值得做的。 另外关于这门课本身，如果想取得一个不错的成绩，课后还是得花很多时间的（当然大佬除外），个人建议课后把xyt讲义全刷一遍（尽管上面写的是“高数B用”），对拓宽思路很有帮助，期末甚至有考讲义上的原题。 个人得分：【90，95） 推荐指数：5/5线性代数B授课教师：李谷川 李老师上课主要按照邱维声《简明线性代数》讲，拓展的内容不多。上课会写板书，但个人感觉板书的内容相对来说比较的乱；每节课会花一部分时间对上节课的内容进行回顾，并且强调其中的重点。个人认为老师讲课还是很清楚的，对于一些比较抽象的内容会举一些最简单的例子辅助理解，而且经常会把教材中一些比较难理解的语言翻译成“人话”。李老师的课并不算热门（起码我们这个学期不算），如果选不上热门的老师可以作为不错的备选。 对于这门课本身，这个学期的期中和期末考试相较前几个学期难度明显下降了很多，但不知道以后会怎样。按照往年的经验，复习的时候除教材外，mym助教的讲义和邱砖都是重要复习资料，考试时有考邱砖上的原题。 个人得分：【90，95） 推荐指数：4/5力学授课教师：刘树新 刘老师上课按照自己编的教材的顺序来讲，上课的调理非常清晰，难度与其他老师相比应该算是最简单的了，对于一些比较难的东西会在课上明确说明不考，对于零基础的同学来说十分友善。在讲力学之外，刘老师还会讲一些历史，还有一些偏哲学的东西，课上时不时会讲一些笑话，总体来说课堂的内容很丰富，听感很不错！ 刘老师会设置一些加分的内容，主要是给他编的教材纠错，还有课上的加分思考题（不是ppt上所有思考题，老师会讲哪些是有加分的），思考题难度很大，很少有同学能拿到加分（我们这学期班里似乎只有一位同学拿到了），不过给教材纠错还是相对比较容易一些（但不知道以后错误会不会被找光了）。 我们这学期没有期中考试，以“给教材课后习题编写解答”的大作业形式进行。期末考试的往年题含量很高，但有两道比较难的大题来限制优秀率（其中一道似乎也是往年题）。另外，网上流传的刘老师的往年题大多比较古早，但事实证明已经足够了（尤其是填空题，重合度很高）。 个人得分：【90，95） 推荐指数：5/5计算概论B授课教师：陈泓婕 如果对计算机不感兴趣，仅仅是想把这门课水过去，并且拿一个不错的分数，陈老师的课或许是个不错的选择。可以选她的课，然后到b站上找个视频或者是找yhf老师的资料自学（需要自学，这很重要），老师给分还是挺不错的。 但如果对计算机很感兴趣，想要进一步学习的，建议找别的老师。 陈老师上课主要按照ppt讲，但个人认为上课讲的比较乱，而且ppt的内容也很乱，如果只是上课的话可能收获不大，并且会消磨对计算机的兴趣（个人观点）。老师上课不定期会有小测，所以需要去上课。平时上机的难度不大，任务量也不大，但这学期的机考难度远超于平时的难度，导致班里得分普遍低，不过如果找别的资料自学的话，还是能取得不错的分数的。 个人得分：【95，100） 推荐指数：2/5（想认真学）；4/5（想水）普通物理实验（1）授课教师：李智（等） 著名的“国家级精品课”，由于我们这届把实验课从大二移到了大一，导致像我这种没什么基础同学每周都要花大量的时间预习实验理论，即便如此，上课老师讲的内容还有很多因为知识储备的欠缺而很难懂。课后写实验报告时涉及理论分析的部分更是要花时间。 这门课广为诟病的原因主要是它的评分机制，不少同学投入了大量的时间却无法收获满意的成绩，而且给分的透明度很低，报告的等第和最终得分的相关性不明确，可能最终的得分主要取决于授课的老师（？）。即便如此，这门课还是需要花很多时间上去的，个人经验是预习的时候多看看课程网站上的视频，写报告的时候可以问问老师对报告的具体要求。 不过，个人认为去除诸如评分体系等等的因素，做实验本身还是相当有意思的，也能学到不少东西。 个人得分：【90，95） 推荐指数：3/5思想道德与法治授课教师：钟启东 今明老师上课基本完全不按教材的内容讲，会讲很多哲学的东西，课上也经常会讲一些笑话，听感很棒。或许比起教材上那些苦涩的内容，老师讲的东西要有意思的多。 另外，这也意味着考试和上课讲的没什么关系，备考的时候建议直接找一份涵盖课后思考题的复习资料背，考的内容大多都在课后思考题上（我们这学期是）。 关于得分，可能由于我们这个班是物院专班，相较于其他班的给分要好点。 个人得分：【95，100） 推荐指数：4/5地震概论授课教师：赵克常 教员伟大，无需多言！ 一门努力就会有回报的课，地震知识+幽默笑话+人生哲学丝滑切换，课堂体验极佳。考前建议把回放再过一边，重点关注教员反复强调的东西。 个人得分：100 推荐指数：5/5军事理论授课教师：户国栋（等） 这门课主要是请国防大学的老师来给我们上课，可以在课上学到很多军事相关的知识，个人感觉挺有意思的，也能拓展视野，了解时事。有签到，需要来上课。 关于考试，除了小论文外，剩下的题目全都在每节课给的思考题上，还有必考的征兵政策，期末直接收一份资料背就行了。 个人得分：【90，95） 推荐指数：3/5形势与政策授课教师：邱华宇（等） pf制，课上会讲一些时政相关的知识，也算是开拓视野吧，没有期末考，要交一篇和课程相关的论文。有签到，需要来上课。 推荐指数：3/5","categories":[],"tags":[{"name":"课程测评","slug":"课程测评","permalink":"https://kzwkzw123.github.io/tags/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"}]},{"title":"Hello World","slug":"hello-world","date":"2025-06-21T10:47:41.049Z","updated":"2025-06-22T07:40:10.103Z","comments":true,"path":"2025/06/21/hello-world/","link":"","permalink":"https://kzwkzw123.github.io/2025/06/21/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[{"name":"课程测评","slug":"课程测评","permalink":"https://kzwkzw123.github.io/tags/%E8%AF%BE%E7%A8%8B%E6%B5%8B%E8%AF%84/"}]}